# Оптимизация СеМО

import numpy as np


def get_c(c, mu, b):
    return sum([c[i] * mu[i]**b[i] for i in range(5)])

L = 5
N = 10 # число требований в сети

theta = np.array([
                [0, .2, .3, .4, .1],
                [.3, 0, .1, .2, .4],
                [.2, .2, 0, .3, .3],
                [.3, .2, .2, 0, .3],
                [.1, .4, .4, .1, 0]])

c = [10, 5, 15, 10, 20]
b = [1, 1, 1, 1, 1]
c_opt = 100

c = [15, 10, 20, 10, 20]
b = [1, 1, 2, 1, 1]
c_opt = 150

c = [15, 10, 20, 15, 25]
b = [1, 2, 2, 1, 1]
c_opt = 200